#+TITLE: Tutorial de Lisp
#+AUTHOR: Patricio Martínez
#+EMAIL: maxxcan@gmail.com
#+DATE: <2019-07-09 mar>
#+LATEX_HEADER:\usepackage[spanish]{babel}

**** Demostración 

#+BEGIN_SRC lisp
; comparación case-sensitiva
(write (string= "esto es una prueba" "Esto es una prueba"))
(terpri)
(write (string> "esto es una prueba" "Esto es una prueba"))
(terpri)
(write (string< "esto es una prueba" "Esto es una prueba"))
(terpri)


; comparación case-insentiva 
(write (string-equal "esto es una prueba" "Esto es una prueba"))
(terpri)
(write (string-greaterp "esto es una prueba" "Esto es una prueba"))
(terpri)
(write (string-lessp "esto es una prueba" "Esto es una prueba"))
(terpri)

; comprobando la no igualdad
(write (string/= "esto es una prueba" "esto es una Prueba"))
(terpri)
(write (string-not-equal "esto es una prueba" "Esto es una prueba"))
(terpri)
(write (string/= "lisp" "lisping"))
(terpri)
(write (string/= "decente" "decencia"))
#+END_SRC

#+RESULTS:
: 5

Y el resultado dará:

#+BEGIN_SRC lisp
NIL
0
NIL
T
NIL
NIL

T
NIL
NIL

12
NIL
4
5


#+END_SRC





** Funciones de control

La siguiente tabla describe las funciones de control

| Sr.No | Función           | Descripción                                      |
|-------+-------------------+--------------------------------------------------|
|     1 | string-upcase     | Convierte la cadena de texto en mayúsculas       |
|     2 | string-downcase   | Convierte la cadena de texto en minúsculas       |
|     3 | string-capitalize | Pone en cursiva cada letra de la cadena de texto |

Ejemplo:

#+BEGIN_SRC lisp
  (write-line (string-upcase " Saludos a todos los lispers"))
  (terpri)
  (write-line (string-capitalize "Saludos a todos los lispers"))
#+END_SRC

#+RESULTS:
: Saludos A Todos Los Lispers

Y cuyo resultado será:

#+BEGIN_SRC lisp

SALUDOS A TODOS LOS LISPERS

Saludos A Todos Los Lispers

#+END_SRC



** Funciones para decorar las cadenas de texto 

La siguiente tabla describe las funciones para adornar a las cadenas de texto. 

| Sr.No | Función           | Descripción                                                                                                                                                               |
|-------+-------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|       |                   | <120>                                                                                                                                                                     |
|     1 | string-trim       | Toma una cadena como primer argumento y otra como segundo argumento y devuelve una nueva cadena donde ha borrado los caracteres de la primera cadena  a la segunda        |
|     2 | String-lef-trim   | Toma una cadena como primer argumento y otra cadena como segundo y devuelve una subcadena donde borra los caractéres de la primera cadena a la segunda desde el principio |
|     3 | String-right-trim | Toma una cadena como primer argumento y otra cadena como segundo y devuelve una subcadena donde borra los caractéres de la primera cadena a la segunda desde el final                                                                                                                                                                              |


Ejemplo:

#+BEGIN_SRC lisp
(write-line (string-trim " " "  saludos a todos los lispers  "))
(write-line (string-left-trim " " "  saludos a todos los lispers  "))
(write-line (string-right-trim " " "  saludos a todos los lispers  "))
(write-line (string-trim " a" "  saludos a todos los lispers  "))
#+END_SRC

#+RESULTS:
: saludos a todos los lispers

Esto devolverá lo siguiente:

#+BEGIN_SRC lisp
saludos a todos los lispers
saludos a todos los lispers  
  saludos a todos los lispers
saludos a todos los lispers
#+END_SRC

** Buscando, Longitudes y Elementos

La función *length* devuelve la longitud de una secuencia, y la función *elt* nos permite acceder a elementos individuales usando un índice entero. 

Ejemplo:

#+BEGIN_SRC lisp
(setq x (vector 'a 'b 'c 'd 'e))
(write (length x))
(terpri)
(write (elt x 3))
#+END_SRC


#+RESULTS:
El resultado será:
: 5
: D

** Modificando secuencias 

Algunas funciones para secuencias nos permiten interaccionar a través de la secuencia y realizar algunas operaciones como, búsquedas, eliminación, conteo o filtrado de elementos específicos sin necesidad de escribir bucles específicos. 

El siguiente ejemplo explica esto:

/Ejemplo 1/

#+BEGIN_SRC lisp
(write (count 7 '(1 5 6 7 8 9 2 7 3 4 5)))
#+END_SRC

#+RESULTS:
: 2

#+BEGIN_SRC lisp
(write (remove 5 '(1 5 6 7 8 9 2 7 3 4 5)))
#+END_SRC

#+RESULTS:
| 1 | 6 | 7 | 8 | 9 | 2 | 7 | 3 | 4 |

#+BEGIN_SRC lisp
(write (delete 5 '(1 5 6 7 8 9 2 7 3 4 5)))
#+END_SRC

#+RESULTS:
| 1 | 6 | 7 | 8 | 9 | 2 | 7 | 3 | 4 |

#+BEGIN_SRC lisp
(write (substitute 10 7 '(1 5 6 7 8 9 2 7 3 4 5)))
#+END_SRC

#+RESULTS:
| 1 | 5 | 6 | 10 | 8 | 9 | 2 | 10 | 3 | 4 | 5 |

#+BEGIN_SRC lisp
(write (find 7 '(1 5 6 7 8 9 2 7 3 4 5)))
#+END_SRC

#+RESULTS:
: 7

#+BEGIN_SRC lisp
(write (position 5 '(1 5 6 7 8 9 2 7 3 4 5)))
#+END_SRC

#+RESULTS:
: 1

/Ejemplo 2/

#+BEGIN_SRC lisp
(write (delete-if #'oddp '(1 5 6 7 8 9 2 7 3 4 5)))
#+END_SRC

#+RESULTS:
| 6 | 8 | 2 | 4 |

#+BEGIN_SRC lisp
(write (delete-if #'evenp '(1 5 6 7 8 9 2 7 3 4 5)))
#+END_SRC

#+RESULTS:
| 1 | 5 | 7 | 9 | 7 | 3 | 5 |

#+BEGIN_SRC lisp
(write (remove-if #'evenp '(1 5 6 7 8 9 2 7 3 4 5)))
#+END_SRC

#+RESULTS:
| 1 | 5 | 7 | 9 | 7 | 3 | 5 |

#+BEGIN_SRC lisp
(setq x (vector 'a 'b 'c 'd 'e 'f 'g))
(fill x 'p :start 1 :end 4)
#+END_SRC

#+RESULTS:
| A | P | P | P | E | F | G |

** Ordenando y uniendo secuencias

Las funciones de ordenamiento toman una secuencia y dos argumentos como predicado y devuelven una versión ordenada de la secuencia

/Ejemplo 1/

#+BEGIN_SRC lisp
(write (sort '(2 4 7 3 9 1 5 4 6 3 8) #'<))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 3 | 4 | 4 | 5 | 6 | 7 | 8 | 9 |



#+BEGIN_SRC lisp
(write (sort '(2 4 7 3 9 1 5 4 6 3 8) #'>))
#+END_SRC

#+RESULTS:
| 9 | 8 | 7 | 6 | 5 | 4 | 4 | 3 | 3 | 2 | 1 |


/Ejemplo 2/

#+BEGIN_SRC lisp
(write (merge 'vector #(1 3 5) #(2 4 6) #'<))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 | 5 | 6 |

#+BEGIN_SRC lisp
(write (merge 'list #(1 3 5) #(2 4 6) #'<))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 | 5 | 6 |

** Mapeando secuencias

Ya hemos discutido las funciones de mapeo. Similar a la función *map* que nos permite aplicar una función a una subsecuencia de elementos de una o más secuencias. 

La función *map* toma un argumento n de función y n secuencias y devuelve una nueva secuencia después de aplicar la función a la subsecuencia de elementos de las secuencias. 

/Ejemplo/

#+BEGIN_SRC lisp
(write (map 'vector #'* #(2 3 4 5) #(3 5 4 8)))
#+END_SRC

#+RESULTS:
| 6 | 15 | 16 | 40 |

** La estructura de registros cons  

Un *cons* es una estructura de registro que contiene dos componentes llamados el *car* y el *cdr*. 

Las células cons o cons son objetos que son pares de valores qeu son creados usando la función *cons*. 

La función *cons* toma dos argumentos y devuelve una nueva célula cons que contiene los dos valores. Esos valores pueden ser referenciados a cualquier tipo de objeto.

Si el segundo valor no es nil, o otra célula cons, entonces los valores son mostrados como un par de puntos encerrados por paréntesis. 

Los dos valores en una célula cons son llamados el *car* y el *cdr*. La función *car* es usada para acceder al primer valor y la función *cdr* es usada para acceder al segundo valor. 

/Ejemplo/

#+BEGIN_SRC lisp
(write (cons 1 2))
#+END_SRC

#+RESULTS:
: (1 . 2)

#+BEGIN_SRC lisp
(write (cons 'a 'b))
#+END_SRC

#+RESULTS:
: (A . B)

#+BEGIN_SRC lisp 
(write (cons 1 nil))
#+END_SRC

#+RESULTS:
| 1 |

#+BEGIN_SRC lisp
(write (cons 1 (cons 2 nil)))
#+END_SRC

#+RESULTS:
| 1 | 2 |

#+BEGIN_SRC lisp
(write (cons 1 (cons 2 (cons 3 nil))))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

#+BEGIN_SRC lisp
(write (cons 'a (cons 'b (cons 'c nil))))
#+END_SRC

#+RESULTS:
| A | B | C |

#+BEGIN_SRC lisp
(write ( car (cons 'a (cons 'b (cons 'c nil)))))
#+END_SRC

#+RESULTS:
: A

#+BEGIN_SRC lisp
(write ( cdr (cons 'a (cons 'b (cons 'c nil)))))
#+END_SRC

#+RESULTS:
| B | C |

En el ejemplo anterior mostramo como las estructucturas cons pueden ser usada para crear una única lista unida, por ejemplo, la lista (A B) consiste en tres células cons enlazadas juntas por sus cdrs.

En un diagrama lo podriamos expresar de la siguiente forma: 




Listas en Lisp

Aunque las células cons pueden ser usadas para crear listas, sin embargo, construir una lista usando llamadas a la función cons pude no ser la mejor solución. La función *list* es bastante más usada para la creación de listas en Lisp. 

La función list puede tomar cualquier número de argumentos y como es una función, evaluará sus argumentos.

Las funciones *fist* y *rest* nos dan el primer elemento y la parte restante de una lista. Los siguientes ejemplos demuestran los conceptos.

/Ejemplo 1/

#+BEGIN_SRC lisp
(write (list 1 2))
#+END_SRC

#+RESULTS:
| 1 | 2 |

#+BEGIN_SRC lisp
(write (list 'a 'b))
#+END_SRC

#+RESULTS:
| A | B |


#+BEGIN_SRC lisp
(write (list 1 nil))
#+END_SRC

#+RESULTS:
| 1 | NIL |

#+BEGIN_SRC lisp
(write (list 1 2 3))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

#+BEGIN_SRC lisp
(write (list 'a 'b 'c))
#+END_SRC

#+RESULTS:
| A | B | C |

#+BEGIN_SRC lisp
(write (list 3 4 'a (car '(b . c)) (* 4 -2)))
#+END_SRC

#+RESULTS:
| 3 | 4 | A | B | -8 |

#+BEGIN_SRC lisp
(write (list (list 'a 'b) (list 'c 'd 'e)))
#+END_SRC

#+RESULTS:
| A | B |   |
| C | D | E |

/Ejemplo 2/

#+BEGIN_SRC lisp
  (defun mi-libreria (titulo autor puntuación disponibilidad)
    (list :titulo titulo :autor autor :puntuación puntuación :disponibilidad disponibilidad)
    )

(write (getf (mi-libreria "Juegos del Hambre" "Collins" 9 t) :titulo))
#+END_SRC

#+RESULTS:
: Juegos del Hambre

** Funciones para la manipulación de las listas

| Sr.No | Función | Descripción                                                                                             |
|-------+---------+---------------------------------------------------------------------------------------------------------|
|     1 | car     | Toma una lista como argumento y devuelve su primer elemento                                             |
|     2 | cdr     | Toma una lista como argumento y devuleve una lista sin el primer elemento                               |
|     3 | cons    | Toma dos argumentos, un elemento y una lista y devuelve una lista con el elemento agregado al principio |
|     4 | list    | Toma cualquier número de argumentos y devuelve una lista con los argumentos como miembros de esa lista  |
|     5 | append  | Une dos o más listas en una                                                                             |
|     6 | last    | Toma una lista y devuelve una lista que contiene el último elemento                                     |
|     7 | member  | Toma dos argumentos el cual el segundo debe ser una lista, y añade el elemento al principio de la lista |
|     8 | reverse | Toma una lista y la devuelve con el orden inverso                                                       |


/Ejemplo 3/

#+BEGIN_SRC lisp
(write (car '(a b c d e f)))
#+END_SRC

#+RESULTS:
: A

#+BEGIN_SRC lisp
(write (cdr '(a b c d e f)))
#+END_SRC

#+RESULTS:
| B | C | D | E | F |

#+BEGIN_SRC lisp
(write (cons 'a '( b c)))
#+END_SRC

#+RESULTS:
| A | B | C |

#+BEGIN_SRC lisp
(write (list 'a '( b c) '(e f)))
#+END_SRC

#+RESULTS:
| A | (B C) | (E F) |

#+BEGIN_SRC lisp
(write (append '(b c) '(e f) '(p q) '() '(g)))
#+END_SRC

#+RESULTS:
| B | C | E | F | P | Q | G |

#+BEGIN_SRC lisp
(write (last '(a b c d (e f))))
#+END_SRC

#+RESULTS:
| E | F |

#+BEGIN_SRC lisp
(write (reverse '(a b c d (e f))))
#+END_SRC

#+RESULTS:
| (E F) | D | C | B | A |


** Concatenación de las funciones car y cdr 


Las funciones *car* y *cdr* y sus combinaciones nos permiten extraer cualquier elemento o miembro en particular de la lista. 

Sin embargo, las secuencias de las funciones de car y cdr pueden ser abreviadas concatenando letras para car y la d de cdr con las letras c y r.

Por ejemplo, podemos escribir cadadr para abreviar la secuencia que llama a la función - car cdr car cdr. 

Así, (cadadr '(a) (c d) (e f g)) devolverá d. 

/Ejemplo 4/

#+BEGIN_SRC lisp
(write (cadadr '(a (c d) (e f g))))
#+END_SRC

#+RESULTS:
: D

#+BEGIN_SRC lisp
(write (caar (list (list 'a 'b) 'c)))
#+END_SRC

#+RESULTS:
: A

#+BEGIN_SRC lisp
(write (cadr (list (list 1 2) (list 3 4))))
#+END_SRC

#+RESULTS:
| 3 | 4 |

